Merge branch 'main' into support-horizontal-scaling
